## Estadística Aplicada

Sesion 4 - 14 agosto

Paulina Quiroz Sánchez 1723927

In [1]:
#lista
lista1=['Jaime', 'Pedro', 'Maria']

In [2]:
#Codigo para anañdir un elemento a la lista
lista1.append('Jimena')

In [3]:
lista1

['Jaime', 'Pedro', 'Maria', 'Jimena']

In [4]:
#Tuplas
tupla1 = (23,45,'libro')

In [5]:
type(tupla1)

tuple

**La principal caracteristica de una tupla es que es inmutable, es decir, no se puede modificar.**
Las listas si las podemos modificar.

Diccionarios (mapeo de valores)
Un diccionario es un par de clave-valor

In [6]:
#Los diccionarios se crean con llaves
alumno_dic = {'Nombre':'Juan', 'Apellido': 'Pérez', 'Edad': 21}

In [7]:
alumno_dic['Nombre']

'Juan'

In [8]:
alumno_dic['Edad']

21

In [9]:
#Accedemos a las variables keys
alumno_dic.keys()

dict_keys(['Nombre', 'Apellido', 'Edad'])

In [10]:
alumno_dic.values()

dict_values(['Juan', 'Pérez', 21])

In [11]:
#crear un diccionario de los alumnos del grupo
estadistica_g41 = {'Nombre' : ['Juan', 'Sebas', 'Sorely'], 'Edad': [19, 19, 18.5]}

In [12]:
estadistica_g41.keys()

dict_keys(['Nombre', 'Edad'])

In [13]:
estadistica_g41.values()

dict_values([['Juan', 'Sebas', 'Sorely'], [19, 19, 18.5]])

*Como nota: Las listas se escriben entre [ ]
Las tuplas entre ( )
Los diccionarios entre { }*

## Pandas
Se utiliza para manipular datos estructurados. Una característica de pandas es que está construida sobre numpy, eso significa que cualquier función de numpy funciona en pandas.En pandas hay tres estructuras de datos : 
1. Series (unidimensionales)
2. Dataframes (datos en filas y columnas)
3. Panel (tiempo)

**Series**

Supongamos que conocemos las edades de las siguientes personas: Juan 10, Pedro 20, Jorge 30, Ale 40, Alba 50

In [14]:
edades = [10, 20, 30, 40, 50]

In [15]:
edades

[10, 20, 30, 40, 50]

In [16]:
#Una serie nos va a permitir etiquetar cada valor
#Importar pandas primero

import pandas as pd

In [17]:
serie1 = pd. Series (edades, index = ['Juan', 'Pedro', 'Jorge', 'Ale', 'Alba'])

In [18]:
serie1

Juan     10
Pedro    20
Jorge    30
Ale      40
Alba     50
dtype: int64

In [19]:
#Promedio de edades
serie1.mean()

30.0

In [20]:
#Desviación estandar de edades
serie1.std()

15.811388300841896

**Dataframes**

Datos en filas y columnas

In [21]:
alumno1 = ['Juan', 'Perez', 23]
alumno2 = ['Raul', 'Gonzalez', 17]
alumno3 = ['Jimena', 'Rosas', 20]
alumno4 = ['Alejandra', 'Saldaña', 21]

In [22]:
clase_estadistica = [alumno1, alumno2, alumno3, alumno4]

In [23]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [24]:
## Convertir en dataframe con pandas
df_clase = pd.DataFrame(clase_estadistica, columns= ['Nombre','Apellido','Edad'])

In [25]:
type(df_clase)

pandas.core.frame.DataFrame

In [26]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [27]:
#Mostras nombre filas
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
#Mostrar nombre columnas
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [29]:
#Añadir una columna
df_clase['Estado'] = ['Nuevo León', 'Coahuila', 'Nuevo León', 'Veracruz']

In [30]:
df_clase

      Nombre  Apellido  Edad      Estado
0       Juan     Perez    23  Nuevo León
1       Raul  Gonzalez    17    Coahuila
2     Jimena     Rosas    20  Nuevo León
3  Alejandra   Saldaña    21    Veracruz

In [31]:
#Cómo cambiar el nombre de las filas
df_clase = df_clase.set_index('Nombre')

In [32]:
df_clase

           Apellido  Edad      Estado
Nombre
Juan          Perez    23  Nuevo León
Raul       Gonzalez    17    Coahuila
Jimena        Rosas    20  Nuevo León
Alejandra   Saldaña    21    Veracruz

In [33]:
#Calcular la edad en días
df_clase['Edad en días'] = df_clase['Edad']* 365

In [34]:
df_clase

           Apellido  Edad      Estado  Edad en días
Nombre
Juan          Perez    23  Nuevo León          8395
Raul       Gonzalez    17    Coahuila          6205
Jimena        Rosas    20  Nuevo León          7300
Alejandra   Saldaña    21    Veracruz          7665

In [35]:
#Añadir una columna que sea la edad en meses
df_clase['Edad en meses'] = df_clase['Edad']*12

In [36]:
df_clase

           Apellido  Edad      Estado  Edad en días  Edad en meses
Nombre
Juan          Perez    23  Nuevo León          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo León          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

## Seleccion de dataframes
1. Selección estándar
2. iloc
3. loc
4. Boleanos (filtros)

In [37]:
df_clase

           Apellido  Edad      Estado  Edad en días  Edad en meses
Nombre
Juan          Perez    23  Nuevo León          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo León          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

In [38]:
## Selección estándar
df_clase['Apellido']

Nombre
Juan            Perez
Raul         Gonzalez
Jimena          Rosas
Alejandra     Saldaña
Name: Apellido, dtype: object

In [39]:
#Añadimos doble corchete porque unos indicar seleccion y los segundos indican la lista que seleccionamos
df_clase[['Apellido', 'Edad']]

           Apellido  Edad
Nombre
Juan          Perez    23
Raul       Gonzalez    17
Jimena        Rosas    20
Alejandra   Saldaña    21

In [40]:
#Selección estandar
df_clase[0:2]

        Apellido  Edad      Estado  Edad en días  Edad en meses
Nombre
Juan       Perez    23  Nuevo León          8395            276
Raul    Gonzalez    17    Coahuila          6205            204

In [41]:
#elegir la columna edad y las filas 0 y 1
#Ojo, primero se indican filas y despues columnas
df_clase[0:2][['Edad', 'Apellido']]

        Edad  Apellido
Nombre
Juan      23     Perez
Raul      17  Gonzalez

Selección iloc o selección por posición.

dataframe.iloc[filas, columnas]

In [42]:
df_clase.iloc[0:2,1]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

In [43]:
df_clase.iloc[:,1]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## Selección por etiquetas .loc
dataframe.loc[filas, columnas]

In [44]:
df_clase.loc[:,'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [45]:
df_clase.loc['Juan','Edad']

23

In [46]:
#Guardar un objeto
edad_juan = df_clase.loc['Juan','Edad']

## Selección con condicionales (boleanos)

In [47]:
df_clase[df_clase['Edad']>20]

          Apellido  Edad      Estado  Edad en días  Edad en meses
Nombre
Juan         Perez    23  Nuevo León          8395            276
Alejandra  Saldaña    21    Veracruz          7665            252

In [48]:
df_clase

           Apellido  Edad      Estado  Edad en días  Edad en meses
Nombre
Juan          Perez    23  Nuevo León          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo León          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

## np.where(condición, valor si se cumple, valor si no se cumple)

In [49]:
import numpy as np

In [50]:
df_clase['Mayor de edad'] = np.where(df_clase['Edad']>=18, 'Mayor de edad', 'Menor de edad')

In [51]:
df_clase

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad
Nombre,,,,,,
Juan,Perez,23,Nuevo León,8395,276,Mayor de edad
Raul,Gonzalez,17,Coahuila,6205,204,Menor de edad
Jimena,Rosas,20,Nuevo León,7300,240,Mayor de edad
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad

## np.select

In [52]:
condiciones = [df_clase['Edad']<=17, 
               df_clase['Edad']<23,
               df_clase['Edad']>=23]
valor_condicion = ['Prepa', 'Licenciatura', 'Egresados']
df_clase['Condición de estudio'] = np.select(condiciones, valor_condicion, default='Invalido')

In [53]:
df_clase

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo León,8395,276,Mayor de edad,Egresados
Raul,Gonzalez,17,Coahuila,6205,204,Menor de edad,Prepa
Jimena,Rosas,20,Nuevo León,7300,240,Mayor de edad,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [54]:
df_clase.count()

Apellido                4
Edad                    4
Estado                  4
Edad en días            4
Edad en meses           4
Mayor de edad           4
Condición de estudio    4
dtype: int64

In [55]:
df_clase.value_counts('Mayor de edad')

Mayor de edad
Mayor de edad    3
Menor de edad    1
dtype: int64

In [56]:
df_clase.value_counts('Condición de estudio')

Condición de estudio
Licenciatura    2
Egresados       1
Prepa           1
dtype: int64

In [57]:
df_clase['Edad'].mean()

20.25

In [58]:
#Obtener promedios por condición
df_clase.groupby('Mayor de edad').mean().round(1)['Edad']

C:\Users\FCFM\AppData\Local\Temp\ipykernel_7380\1090307317.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_clase.groupby('Mayor de edad').mean().round(1)['Edad']

Mayor de edad
Mayor de edad    21.3
Menor de edad    17.0
Name: Edad, dtype: float64

In [59]:
#aggregate agg
df_clase.agg(['count', 'mean'])

C:\Users\FCFM\AppData\Local\Temp\ipykernel_7380\3480107350.py:2: FutureWarning: ['Apellido', 'Estado', 'Mayor de edad', 'Condición de estudio'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_clase.agg(['count', 'mean'])

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad,Condición de estudio
count,4.0,4.00,4.0,4.00,4.0,4.0,4.0
mean,NaN,20.25,NaN,7391.25,243.0,NaN,NaN

In [60]:
import pandas as pd

In [61]:
## Query es una selección con condicionales alternativa 
df_clase.query('Edad>20')

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo León,8395,276,Mayor de edad,Egresados
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [62]:
#Seleccionar a Alejandra
df_clase.query('Nombre=="Alejandra"')

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [63]:
## Seleccionar a Alejandra y los que sean mayores de 20
df_clase.query('Nombre=="Alejandra" & Edad>20')

,Apellido,Edad,Estado,Edad en días,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [64]:
#Leer base de datos desde un archivo
calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [65]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [66]:
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [67]:
#Verifica cuantas filas y columas tiene el dataframe
calificaciones.shape

(28, 4)

In [68]:
#Primeras 5 observaciones
calificaciones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [69]:
#Primeras 10 observaciones
calificaciones.head(10)

   Id            Nombre   Apellido  Calficación Final
0   1           ANTONIO     GARCIA                 73
1   2            MANUEL  FERNANDEZ                 19
2   3              JOSE   GONZALEZ                 38
3   4             DAVID      PEREZ                 14
4   5              JUAN      LOPEZ                 99
5   6      JOSE ANTONIO  RODRIGUEZ                 66
6   7            JAVIER    SANCHEZ                 46
7   8         JOSE LUIS      GOMEZ                 89
8   9  FRANCISCO JAVIER    JIMENEZ                 10
9  10            CARLOS       RUIZ                 62

In [70]:
#Primeras 2 observaciones
calificaciones.head(2)

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19

In [71]:
#Las ultimas 7
calificaciones.tail(7)

    Id       Nombre   Apellido  Calficación Final
21  22     FERNANDO    SALAZAR                 51
22  23        JORGE      RAMOS                 76
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [72]:
## vamos a elegir todas las columnas menos id
calificaciones = calificaciones.loc[:,calificaciones.columns!='Id']

In [73]:
calificaciones.head()

    Nombre   Apellido  Calficación Final
0  ANTONIO     GARCIA                 73
1   MANUEL  FERNANDEZ                 19
2     JOSE   GONZALEZ                 38
3    DAVID      PEREZ                 14
4     JUAN      LOPEZ                 99

In [74]:
# renombrar
calificaciones = calificaciones.rename(columns={'Calficación Final':'CalFin'})

In [75]:
calificaciones

              Nombre   Apellido  CalFin
0            ANTONIO     GARCIA      73
1             MANUEL  FERNANDEZ      19
2               JOSE   GONZALEZ      38
3              DAVID      PEREZ      14
4               JUAN      LOPEZ      99
5       JOSE ANTONIO  RODRIGUEZ      66
6             JAVIER    SANCHEZ      46
7          JOSE LUIS      GOMEZ      89
8   FRANCISCO JAVIER    JIMENEZ      10
9             CARLOS       RUIZ      62
10             JESUS     ALONSO      94
11         ALEJANDRO  HERNANDEZ      17
12            MIGUEL       DIAZ      85
13       JOSE MANUEL  GUTIERREZ      34
14            RAFAEL    ALVAREZ      86
15      MIGUEL ANGEL     MORENO     100
16             PEDRO      MUÑOZ       1
17             PABLO     BLANCO      64
18             ANGEL        GIL     100
19            SERGIO    AGUIRRE       2
20        JOSE MARIA       DIEZ      29
21          FERNANDO    SALAZAR      51
22             JORGE      RAMOS      76
23              LUIS  DOMINGUEZ      12
24           ALBERTO      ORTIZ      99
25       JUAN CARLOS     IBAÑEZ      43
26            ALVARO    RAMIREZ      40
27            ADRIAN       SAEZ       7

In [76]:
#Agregar situacion, mayor o igual a 70, aprobado, si no, reprobado, 
#Cuántos aprobados y cuantos reprobados

import numpy as np

In [78]:
calificaciones['Situación'] = np.where(calificaciones['CalFin']>=70, 'Aprobado', 'Reprobado')

In [79]:
calificaciones

              Nombre   Apellido  CalFin  Situación
0            ANTONIO     GARCIA      73   Aprobado
1             MANUEL  FERNANDEZ      19  Reprobado
2               JOSE   GONZALEZ      38  Reprobado
3              DAVID      PEREZ      14  Reprobado
4               JUAN      LOPEZ      99   Aprobado
5       JOSE ANTONIO  RODRIGUEZ      66  Reprobado
6             JAVIER    SANCHEZ      46  Reprobado
7          JOSE LUIS      GOMEZ      89   Aprobado
8   FRANCISCO JAVIER    JIMENEZ      10  Reprobado
9             CARLOS       RUIZ      62  Reprobado
10             JESUS     ALONSO      94   Aprobado
11         ALEJANDRO  HERNANDEZ      17  Reprobado
12            MIGUEL       DIAZ      85   Aprobado
13       JOSE MANUEL  GUTIERREZ      34  Reprobado
14            RAFAEL    ALVAREZ      86   Aprobado
15      MIGUEL ANGEL     MORENO     100   Aprobado
16             PEDRO      MUÑOZ       1  Reprobado
17             PABLO     BLANCO      64  Reprobado
18             ANGEL        GIL     100   Aprobado
19            SERGIO    AGUIRRE       2  Reprobado
20        JOSE MARIA       DIEZ      29  Reprobado
21          FERNANDO    SALAZAR      51  Reprobado
22             JORGE      RAMOS      76   Aprobado
23              LUIS  DOMINGUEZ      12  Reprobado
24           ALBERTO      ORTIZ      99   Aprobado
25       JUAN CARLOS     IBAÑEZ      43  Reprobado
26            ALVARO    RAMIREZ      40  Reprobado
27            ADRIAN       SAEZ       7  Reprobado

In [80]:
calificaciones.value_counts('Situación')

Situación
Reprobado    18
Aprobado     10
dtype: int64